app/controllers/lists_controller.rb

  def index
    @lists = List.all
---
SELECT "lists".* FROM "lists"  ORDER BY ID ASC

  def update
    respond_to do |format|
      if @list.update(list_params)
---
UPDATE "lists" SET "asia" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["asia", 123456789], ["updated_at", "2016-07-28 10:40:45.864355"], ["id", 2]]